SkyRocketToys/STM8TX/lib/beken.c
	//********************Write Bank0 register******************
	for (i=20; i >= 0; i--) // From BK_FIFO_STATUS back to beginning of table
	{
		uint8_t idx = Bank0_Reg[i][0];
		uint8_t value = Bank0_Reg[i][1];
		if (idx == BK_RF_SETUP) // Adjust for speed
			value = Bank0_Reg6[spd][1];
		SPI_Write_Reg((BK_WRITE_REG|idx), value);
	}

	// Set the various 5 byte addresses
	SPI_Write_Buf((BK_WRITE_REG|BK_RX_ADDR_P0),RX0_Address,5); // reg 10 - Rx0 addr
	SPI_Write_Buf((BK_WRITE_REG|BK_RX_ADDR_P1),RX1_Address,5); // REG 11 - Rx1 addr
	SPI_Write_Buf((BK_WRITE_REG|BK_TX_ADDR),TX_Address,5); // REG 16 - TX addr

#if RADIO_BEKEN
	i = SPI_Read_Reg(BK_FEATURE);
	if (i == 0) // i!=0 showed that chip has been actived.so do not active again.
		SPI_Write_Reg(BK_ACTIVATE_CMD,0x73);// Active
#endif
	for (i = 22; i >= 21; i--)
		SPI_Write_Reg((BK_WRITE_REG|Bank0_Reg[i][0]),Bank0_Reg[i][1]);

#if RADIO_BEKEN
	//********************Write Bank1 register******************
	SetRBank(1);
	for (i = IREG1_4; i <= IREG1_13; i++)
	{
		const uint8_t* p = &Bank1_RegTable[spd][i][0];
		uint8_t idx = *p++;
		SPI_Write_Buf((BK_WRITE_REG|idx), p, 4);
	}
	SPI_Write_Buf((BK_WRITE_REG|BK2425_R1_14),&(Bank1_Reg14[0]),11);

//toggle REG4<25,26>
	{
		const uint8_t* p = &Bank1_RegTable[spd][IREG1_4A][0];
		uint8_t idx = *p++;
		SPI_Write_Buf((BK_WRITE_REG|idx), p, 4);
	}
	{
		const uint8_t* p = &Bank1_RegTable[spd][IREG1_4][0];
		uint8_t idx = *p++;
		SPI_Write_Buf((BK_WRITE_REG|idx), p, 4);
	}

	delay_ms(100);//delay more than 50ms.

	/********************switch back to Bank0 register access******************/
	SetRBank(0);
#else
	delay_ms(100);
#endif
	SwitchToRxMode(); // switch to RX mode
	bkReady = 1;
}

// ----------------------------------------------------------------------------
bool bRadioFast = false;
/** Change between 250kbps and 2000kbps on the fly */
void BK2425_SetSpeed(
	bool bFast) ///< false=slow speed, true=fast speed
{
	ITX_SPEED spd = ITX_250;
	if (bFast == bRadioFast)
		return;
	if (bFast)
		spd = ITX_2000;
	gpio_config(RADIO_INT, GPIO_INPUT_PULLUP);
	SwitchToSleepMode();
	BK2425_Initialize(spd);
	gpio_config(RADIO_INT, GPIO_INPUT_PULLUP_IRQ);
	bRadioFast = bFast;
}

#if RADIO_BEKEN
// ----------------------------------------------------------------------------
/** Write a 32-bit Bank1 register */
void SPI_Bank1_Write_Reg(
	uint8_t reg, ///< A spi register in bank1 to write to #BK_SPI_CMD_e
	const uint8_t *pBuf) ///< A pointer to a 32-bit buffer to be written
{
	SetRBank(1);
	SPI_Write_Buf(reg, pBuf, 4);
	SetRBank(0);
}

// ----------------------------------------------------------------------------
/** Read a 32-bit Bank1 register */
void SPI_Bank1_Read_Reg(
	uint8_t reg, ///< A spi register in bank1 to write to #BK_SPI_CMD_e
	uint8_t *pBuf) ///< A pointer to a 32-bit buffer to be read into
{
	SetRBank(1);
	spi_read_registers(reg, pBuf, 4);
	SetRBank(0);
}
#endif

// ----------------------------------------------------------------------------
/** Change the radio channel */
void ChangeChannel(
	uint8_t channelNumber) ///< A physical radio channel. See #CHANNEL_MHZ_e
{
	if (channelNumber > CHANNEL_MAX_PHYSICAL)
		return;
	SPI_Write_Reg((BK_WRITE_REG|BK_RF_CH), channelNumber);
}

// ----------------------------------------------------------------------------
/* Clear the radio acknowledge overflow status of the Beken chip.
	\return true if BK_STATUS_MAX_RT was found in the set state, false otherwise */
bool ClearAckOverflow(void)
{
	uint8_t status = SPI_Read_Status();
	if ((BK_STATUS_MAX_RT & status) == 0)
	{
    	return false;
	}
	else
	{
		SPI_Write_Reg((BK_WRITE_REG|BK_STATUS), BK_STATUS_MAX_RT);
    	return true;
	}
}

// ----------------------------------------------------------------------------
/** Initialise the Beken chip ready to be talked to */
void initBeken(void)
{
	/* Set ChipSelect pin in Output push-pull high level in spi_init() */
	BEKEN_DESELECT();
	BEKEN_CE_LOW();
}

// ----------------------------------------------------------------------------
/** DeInitialise the Beken chip after talking */
void deinitBeken(void)
{
}

// ----------------------------------------------------------------------------
/** Describe our transmission parameters to the serial port for verification by the tester */
void describeBeken(void)
{
#if SUPPORT_UART
	printf("# TxSpeed %dkbps\r\n", (int) BK2425_GetSpeed() );
	printf("# Channels[%d]=", (int) CHANNEL_COUNT_LOGICAL );
	for (uint8_t i = 0; i < CHANNEL_COUNT_LOGICAL; ++i)
	{
		printf("%d ", (int) LookupChannel(i));
	}
	printf("\r\n##########\r\n");
#endif
}


// ----------------------------------------------------------------------------
PAIRADDR address; // Workaround for compiler bug whereby it was conflating bits 8..15 and 16..23 if a long is passed in as a parameter
uint8_t gRxDefault = 1;
uint8_t gRxCh = 0;
/** Change pipeline address */
void ChangeAddress(
	PAIRADDR tmpaddress, ///<
	uint8_t rxch) ///<
{
	address = tmpaddress; // Attempt to work around compiler bug in IAR STM8 compiler 2.20.1
	if (address > PAIRADDR_MASK)
		return;
	if (address == PAIRADDR_DEFAULT)
		gRxDefault = 1;
	else
		gRxDefault = 0;

//	if (address != PAIRADDR_DEFAULT && address != pairAddress)
//		printf("Compiler bug!\r\n");
	TX_Address[0] = (address >> 16) & 0xff;
	TX_Address[3] = (address >> 8) & 0xff;
	TX_Address[4] = (address) & 0xff;
	RX0_Address[0] = ((address >> 16) & 0xff) | 0x80;
	RX0_Address[3] = (address >> 8) & 0xff;
	RX0_Address[4] = (address) & 0xff;

	printf("Txaddr %08lx == %08lx -> %02x %02x %02x %02x %02x\r\n",
		address, pairAddress, TX_Address[0], TX_Address[1],
		TX_Address[2], TX_Address[3], TX_Address[4]);
	SPI_Write_Buf((BK_WRITE_REG|BK_RX_ADDR_P0), RX0_Address, 5); // reg 10 - Rx0 addr is of drone
	SPI_Write_Buf((BK_WRITE_REG|BK_RX_ADDR_P1), RX1_Address, 5);
	SPI_Write_Buf((BK_WRITE_REG|BK_TX_ADDR), TX_Address, 5); // REG 16 - TX addr
	SPI_Write_Reg((BK_WRITE_REG|BK_EN_RXADDR), rxch); // Listen to one or two addresses
	gRxCh = rxch;
}

