SkyRocketToys/STM8TX/lib/beken.c
	// Clear the bits
	SPI_Write_Reg((BK_WRITE_REG|BK_STATUS), (BK_STATUS_MAX_RT | BK_STATUS_TX_DS | BK_STATUS_RX_DR));
	// What is this code for? Did it used to be an attempt to mask radio interrupts?
	gpio_config(RADIO_INT, GPIO_INPUT_PULLUP_IRQ);
}

uint8_t lastTxChannel; // 0..CHANNEL_COUNT_LOGICAL
uint16_t lastTxPacketCount;

// ----------------------------------------------------------------------------
/** The IRQ routine that needs to be called on timer interrupts for the Beken chip */
void beken_timer_irq(void)
{
	static uint8_t txChannel = 0;
//...	TIM3->SR1 = (uint8_t)(~TIM3_IT_UPDATE);
	if (!bkReady) // We are reinitialising the chip in the main thread
		return;

	// Change to the next (non-ignored) channel
	txChannel = NextChannelIndex(txChannel);
	ChangeChannel(LookupChannel(txChannel));
	FlushTx(); // Discard any buffered tx bytes
	ClearAckOverflow();

	// Support sending reconnect packets
	if (commsState == COMMS_STATE_DISCONNECTED)
	{
		switch (lastTxPacketCount & 255) {
		case 0+8: // Switch here quickly
			SwitchToIdleMode();
			ChangeAddressTx(reconnectAddress, 0); // Paired address (try this first on bootup)
			break;
		case 128+8:
			SwitchToIdleMode();
			ChangeAddressTx(reconnectAddress, 1); // Default address
			break;
		};
	}
	SwitchToTxMode();
	pktDataTx.channel = txChannel; // Tell the receiver where in the sequence this was broadcast from.
	lastTxChannel = txChannel;
	lastTxPacketCount++;
	Send_Packet(BK_WR_TX_PLOAD, (uint8_t *)&pktDataTx, PACKET_LENGTH_TX);
}

// ----------------------------------------------------------------------------
/** Start sending a binding packet */
void beken_start_bind_send(void)
{
	//...
}

// ----------------------------------------------------------------------------
/** Start sending a control data packet */
void beken_start_send(void)
{
	//...
}

// ----------------------------------------------------------------------------
/** Start sending an FCC test packet */
void beken_start_FCC_test(void)
{
	//...
}

// ----------------------------------------------------------------------------
/** Start sending an factory test packet */
void beken_start_factory_test(
	uint8_t test_mode) ///< The type of test to send.
{
	//...
}

// ----------------------------------------------------------------------------
/** Set the next FCC power */
void beken_next_FCC_power(void)
{
	//...
}

// ----------------------------------------------------------------------------
/** Go into continuous carrier wave send mode or normal mode */
void beken_set_CW_mode(
	bool cw) ///< false=normal, true=carrier wave
{
	//...
}

// ----------------------------------------------------------------------------
/** Change the FCC channel */
void beken_change_FCC_channel(
	int8_t change) ///< ?
{
	//...
}

// ----------------------------------------------------------------------------
/** Toggle the FCC scan */
void beken_FCC_toggle_scan(void)
{
	//...
}

// ----------------------------------------------------------------------------
/** Get the current tx power */
uint8_t get_tx_power(void)
{
	//...
	return 0;
}

// ----------------------------------------------------------------------------
/** Get the current FCC channel */
int8_t get_FCC_chan(void)
{
	//...
	return 0;
}

// ----------------------------------------------------------------------------
/** Get the current FCC power */
uint8_t get_FCC_power(void)
{
	//...
	return 0;
}

/** @}*/

#endif
